osamaomar1012/Robotics_Projects_Arduino/ESP32_OLED_HPP_CAMERA_V2/EL-BASEET_HPP_Advance/web_server.h
#ifndef WEB_SERVER_H
#define WEB_SERVER_H

#include <WiFi.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include "esp_camera.h"
#include "BoardConfig.h"
#include <Preferences.h>
#include <esp_wifi.h>

WebServer server(STREAM_PORT);
volatile float currentFPS = 0.0;
extern Preferences preferences;
volatile unsigned long lastEspNowFrameRequest = 0; // Timestamp for priority locking (CrowPanel heartbeat)
extern uint8_t targetMac[6];
volatile bool isWebStreaming = false; // Flag to track active web stream
extern volatile bool cameraActive;

// Externs and Prototypes for Surgical Control
extern int16_t motorSpeed;   
extern float batteryVoltage, currentDraw, batteryPower, baselineCurrent;
extern float maxCurrentThreshold, minVoltageThreshold, penetrationOffset, penetrationHysteresis;
extern uint32_t estimatedRPM, penetrationCount;
extern uint8_t webBaseSpeed, batteryPercent;
extern bool systemEnabled, forwardDirection, safetyTripped, lowBatteryTripped, debugMode, isPenetrating, calibrationNeeded, wifiConnecting;
extern uint8_t flashBrightness;
extern const char* ssid_sta;
extern const char* pass_sta;
extern const char* ssid_ap;
extern Preferences preferences;

extern void displayWebConfirmation(String msg);

void setMotorSpeed(int speed);

// WiFi Config Page HTML
const char WIFI_HTML[] PROGMEM = R"=====(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>EL-BASEET - WiFi</title>
<style>
    body { font-family: 'Segoe UI', system-ui, sans-serif; text-align: center; background: radial-gradient(circle at top, #1e293b, #0f172a); color: white; margin: 0; min-height: 100vh; }
    .container { max-width: 400px; margin: auto; padding: 20px; }
    .header-wrap { display: flex; align-items: center; justify-content: center; gap: 15px; margin-bottom: 25px; }
    .logo-svg { width: 32px; height: 32px; fill: #38bdf8; animation: spin 5s linear infinite; filter: drop-shadow(0 0 8px rgba(56, 189, 248, 0.4)); }
    @keyframes spin { 100% { transform: rotate(360deg); } }
    h2 { font-weight: 300; letter-spacing: 2px; color: #38bdf8; text-transform: uppercase; margin: 0; }
    .card { background: rgba(30, 41, 59, 0.7); backdrop-filter: blur(10px); padding: 20px; margin: 15px 0; border-radius: 15px; border: 1px solid rgba(255, 255, 255, 0.05); }
    input, select { width: 90%; padding: 12px; margin: 10px 0; background: #334155; color: white; border: 1px solid #475569; border-radius: 8px; outline: none; }
    .btn { padding: 12px 20px; font-size: 15px; margin: 5px; cursor: pointer; border: none; border-radius: 8px; color: white; transition: 0.3s; font-weight: 600; text-transform: uppercase; }
    .btn-blue { background: #0284c7; }
    .btn-green { background: #10b981; width: 100%; margin-top: 15px; }
    .link-footer { margin-top: 25px; display: block; color: #94a3b8; text-decoration: none; font-size: 0.85em; }
</style>
</head><body>
    <div class="container">
        <div class="header-wrap">
            <svg class="logo-svg" viewBox="0 0 24 24"><path d="M12,15.5A3.5,3.5 0 0,1 8.5,12A3.5,3.5 0 0,1 12,8.5A3.5,3.5 0 0,1 15.5,12A3.5,3.5 0 0,1 12,15.5M19.43,12.97C19.47,12.65 19.5,12.33 19.5,12C19.5,11.67 19.47,11.34 19.43,11L21.54,9.37C21.73,9.22 21.78,8.95 21.66,8.73L19.66,5.27C19.54,5.05 19.27,4.97 19.05,5.05L16.56,6.05C16.04,5.66 15.5,5.32 14.87,5.07L14.5,2.42C14.46,2.18 14.25,2 14,2H10C9.75,2 9.54,2.18 9.5,2.42L9.13,5.07C8.5,5.32 7.96,5.66 7.44,6.05L4.95,5.05C4.73,4.97 4.46,5.05 4.34,5.27L2.34,8.73C2.21,8.95 2.27,9.22 2.46,9.37L4.57,11C4.53,11.34 4.5,11.67 4.5,12C4.5,12.33 4.53,12.65 4.57,12.97L2.46,14.63C2.27,14.78 2.21,15.05 2.34,15.27L4.34,18.73C4.46,18.95 4.73,19.03 4.95,18.95L7.44,17.94C7.96,18.34 8.5,18.68 9.13,18.93L9.5,21.58C9.54,21.82 9.75,22 10,22H14C14.25,22 14.46,21.82 14.5,21.58L14.87,18.93C15.5,18.68 16.04,18.34 16.56,17.94L19.05,18.95C19.27,19.03 19.54,18.95 19.66,18.73L21.66,15.27C21.78,15.05 21.73,14.78 21.54,14.63L19.43,12.97Z"/></svg>
            <h2>WIFI SETUP</h2>
        </div>
        <div class="card">
            <button class="btn btn-blue" onclick="scan()">SCAN NETWORKS</button>
            <div id="networks"></div>
            <form action="/savewifi" method="POST">
                <input type="text" name="ssid" id="ssid" placeholder="Enter SSID" required>
                <input type="password" name="pass" id="pass" placeholder="Enter Password">
                <input type="submit" class="btn btn-green" value="SAVE & RESTART">
            </form>
        </div>
        <a href="/" class="link-footer">&larr; Return to Dashboard</a>
    </div>
    <script>
        function scan() {
            document.getElementById('networks').innerHTML = "<p>Scanning...</p>";
            fetch('/scan').then(r => r.json()).then(data => {
                let html = '<select onchange="document.getElementById(\'ssid\').value=this.value">';
                html += '<option value="">-- Select Network --</option>';
                data.forEach(n => { html += `<option value="${n.ssid}">${n.ssid} (${n.rssi}dBm)</option>`; });
                html += '</select>';
                document.getElementById('networks').innerHTML = html;
            });
        }
    </script>
</body></html>)=====";

// Detailed Readings Page
const char READINGS_HTML[] PROGMEM = R"=====(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>EL-BASEET - Readings</title>
<style>
    body { font-family: 'Segoe UI', system-ui, sans-serif; text-align: center; background: radial-gradient(circle at top, #1e293b, #0f172a); color: white; margin: 0; min-height: 100vh; }
    .container { max-width: 400px; margin: auto; padding: 20px; }
    .header-wrap { display: flex; align-items: center; justify-content: center; gap: 15px; margin-bottom: 25px; }
    .logo-svg { width: 32px; height: 32px; fill: #38bdf8; animation: spin 5s linear infinite; filter: drop-shadow(0 0 8px rgba(56, 189, 248, 0.4)); }
    @keyframes spin { 100% { transform: rotate(360deg); } }
    h2 { font-weight: 300; letter-spacing: 2px; color: #38bdf8; text-transform: uppercase; }
    .card { background: rgba(30, 41, 59, 0.7); backdrop-filter: blur(10px); padding: 20px; margin: 15px 0; border-radius: 15px; border: 1px solid rgba(255, 255, 255, 0.05); display: flex; justify-content: space-around; }
    .btn { padding: 8px 15px; font-size: 12px; cursor: pointer; border: none; border-radius: 6px; color: white; transition: 0.3s; font-weight: 600; text-transform: uppercase; }
    .value { color: #10b981; font-weight: 600; font-size: 1.3em; font-family: 'Courier New', Courier, monospace; }
    .label { font-size: 0.75em; color: #94a3b8; margin-bottom: 8px; text-transform: uppercase; letter-spacing: 1px; }
    .link-footer { margin-top: 25px; display: block; color: #38bdf8; text-decoration: none; font-size: 0.85em; }
</style>
</head><body>
    <div class="container">
        <div class="header-wrap">
            <svg class="logo-svg" viewBox="0 0 24 24"><path d="M12,15.5A3.5,3.5 0 0,1 8.5,12A3.5,3.5 0 0,1 12,8.5A3.5,3.5 0 0,1 15.5,12A3.5,3.5 0 0,1 12,15.5M19.43,12.97C19.47,12.65 19.5,12.33 19.5,12C19.5,11.67 19.47,11.34 19.43,11L21.54,9.37C21.73,9.22 21.78,8.95 21.66,8.73L19.66,5.27C19.54,5.05 19.27,4.97 19.05,5.05L16.56,6.05C16.04,5.66 15.5,5.32 14.87,5.07L14.5,2.42C14.46,2.18 14.25,2 14,2H10C9.75,2 9.54,2.18 9.5,2.42L9.13,5.07C8.5,5.32 7.96,5.66 7.44,6.05L4.95,5.05C4.73,4.97 4.46,5.05 4.34,5.27L2.34,8.73C2.21,8.95 2.27,9.22 2.46,9.37L4.57,11C4.53,11.34 4.5,11.67 4.5,12C4.5,12.33 4.53,12.65 4.57,12.97L2.46,14.63C2.27,14.78 2.21,15.05 2.34,15.27L4.34,18.73C4.46,18.95 4.73,19.03 4.95,18.95L7.44,17.94C7.96,18.34 8.5,18.68 9.13,18.93L9.5,21.58C9.54,21.82 9.75,22 10,22H14C14.25,22 14.46,21.82 14.5,21.58L14.87,18.93C15.5,18.68 16.04,18.34 16.56,17.94L19.05,18.95C19.27,19.03 19.54,18.95 19.66,18.73L21.66,15.27C21.78,15.05 21.73,14.78 21.54,14.63L19.43,12.97Z"/></svg>
            <h2>READINGS</h2>
        </div>
        <div class="card">
            <div><div class="label">VOLTAGE</div><div id="v" class="value">0.0V</div></div>
            <div><div class="label">CURRENT</div><div id="i" class="value">0.0A</div></div>
            <div><div class="label">POWER</div><div id="p" class="value">0.0W</div></div>
        </div>
        <div class="card">
            <div><div class="label">BATTERY</div><div id="pct" class="value">0%</div></div>
            <div><div class="label">FPS</div><div id="fps" class="value">0</div></div>
        </div>
        <div class="card">
            <div><div class="label">GRAFTS</div><div id="cnt" class="value">0</div></div>
            <div><div class="label">RPM</div><div id="rpm" class="value">0</div></div>
        </div>
        <div class="card" style="flex-direction: column; align-items: center;">
            <div><div class="label">BASELINE I</div><div id="baseI" class="value">0.0A</div></div>
            <button id="calBtn" class="btn" style="background: #475569; margin-top: 10px;" onclick="sendCmd('calibrate', 'now')">RE-CALIBRATE</button>
            <div id="calMsg" style="color: #f39c12; display:none; margin-top: 10px;">CALIBRATING...</div>
        </div>
        <div class="card">
            <div><div class="label">WiFi MODE</div><div id="wifi" class="value">-</div></div>
            <div><div class="label">IP ADDR</div><div id="ip" class="value">-</div></div>
        </div>
        <a href="/" class="link-footer">&larr; BACK TO DASHBOARD</a>
    </div>
    <script>
        function sendCmd(cmd, val) { fetch(`/control?cmd=${cmd}&val=${val}`); }
        setInterval(() => {
            fetch('/telemetry').then(r => r.json()).then(data => {
                document.getElementById('v').innerText = data.v + 'V';
                document.getElementById('i').innerText = data.i + 'A';
                document.getElementById('p').innerText = data.p + 'W';
                document.getElementById('pct').innerText = data.pct + '%';
                document.getElementById('fps').innerText = data.fps;
                document.getElementById('cnt').innerText = data.cnt;
                document.getElementById('rpm').innerText = data.rpm;
                document.getElementById('baseI').innerText = data.baseI + 'A';
                document.getElementById('wifi').innerText = data.wifi_mode;
                document.getElementById('ip').innerText = data.ip;
                document.getElementById('calMsg').style.display = data.calib ? 'block' : 'none';
                document.getElementById('calBtn').style.display = data.calib ? 'none' : 'inline-block';
            });
        }, 1000);
    </script>
</body></html>)=====";

