osamaomar1012/Robotics_Projects_Arduino/ESP32_OLED_HPP_CAMERA_V2/EL-BASEET_HPP_Advance/web_server.h
// Configuration & Safety Page
const char CONFIG_HTML[] PROGMEM = R"=====(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>EL-BASEET - Config</title>
<style>
    body { font-family: 'Segoe UI', system-ui, sans-serif; text-align: center; background: radial-gradient(circle at top, #1e293b, #0f172a); color: white; margin: 0; min-height: 100vh; }
    .container { max-width: 400px; margin: auto; padding: 20px; }
    .header-wrap { display: flex; align-items: center; justify-content: center; gap: 15px; margin-bottom: 25px; }
    .logo-svg { width: 32px; height: 32px; fill: #38bdf8; animation: spin 5s linear infinite; filter: drop-shadow(0 0 8px rgba(56, 189, 248, 0.4)); }
    @keyframes spin { 100% { transform: rotate(360deg); } }
    h2 { font-weight: 300; letter-spacing: 2px; color: #38bdf8; text-transform: uppercase; margin: 0; }
    .card { background: rgba(30, 41, 59, 0.7); backdrop-filter: blur(10px); padding: 20px; margin: 15px 0; border-radius: 15px; border: 1px solid rgba(255, 255, 255, 0.05); }
    .btn { padding: 12px 20px; font-size: 13px; margin: 5px; cursor: pointer; border: none; border-radius: 8px; color: white; width: 90%; font-weight: 600; text-transform: uppercase; letter-spacing: 1px; transition: 0.3s; }
    input { width: 70px; background: #334155; color: white; border: 1px solid #475569; padding: 8px; text-align: center; border-radius: 6px; }
    .label { font-size: 0.7em; color: #94a3b8; margin-bottom: 8px; text-transform: uppercase; letter-spacing: 1.5px; }
    .flex-row { display: flex; justify-content: space-around; align-items: center; margin: 10px 0; }
    .debug-on { background: #f59e0b !important; color: #000 !important; }
    .link-footer { margin-top: 25px; display: block; color: #38bdf8; text-decoration: none; font-size: 0.85em; }
</style>
</head><body>
    <div class="container">
        <div class="header-wrap">
            <svg class="logo-svg" viewBox="0 0 24 24"><path d="M12,15.5A3.5,3.5 0 0,1 8.5,12A3.5,3.5 0 0,1 12,8.5A3.5,3.5 0 0,1 15.5,12A3.5,3.5 0 0,1 12,15.5M19.43,12.97C19.47,12.65 19.5,12.33 19.5,12C19.5,11.67 19.47,11.34 19.43,11L21.54,9.37C21.73,9.22 21.78,8.95 21.66,8.73L19.66,5.27C19.54,5.05 19.27,4.97 19.05,5.05L16.56,6.05C16.04,5.66 15.5,5.32 14.87,5.07L14.5,2.42C14.46,2.18 14.25,2 14,2H10C9.75,2 9.54,2.18 9.5,2.42L9.13,5.07C8.5,5.32 7.96,5.66 7.44,6.05L4.95,5.05C4.73,4.97 4.46,5.05 4.34,5.27L2.34,8.73C2.21,8.95 2.27,9.22 2.46,9.37L4.57,11C4.53,11.34 4.5,11.67 4.5,12C4.5,12.33 4.53,12.65 4.57,12.97L2.46,14.63C2.27,14.78 2.21,15.05 2.34,15.27L4.34,18.73C4.46,18.95 4.73,19.03 4.95,18.95L7.44,17.94C7.96,18.34 8.5,18.68 9.13,18.93L9.5,21.58C9.54,21.82 9.75,22 10,22H14C14.25,22 14.46,21.82 14.5,21.58L14.87,18.93C15.5,18.68 16.04,18.34 16.56,17.94L19.05,18.95C19.27,19.03 19.54,18.95 19.66,18.73L21.66,15.27C21.78,15.05 21.73,14.78 21.54,14.63L19.43,12.97Z"/></svg>
            <h2>CONFIG</h2>
        </div>
        <div class="card">
            <div class="label">Safety Thresholds</div>
            <div class="flex-row">
                <div><div class="label">Max I (A)</div><input type="number" id="mc" step="0.1"></div>
                <div><div class="label">Min V (V)</div><input type="number" id="mv" step="0.1"></div>
            </div>
            <button class="btn" style="background: #ea580c;" onclick="saveSafety()">SAVE SAFETY</button>
        </div>
        <div class="card">
            <div class="label">Graft Sensitivity</div>
            <div class="flex-row">
                <div><div class="label">Spike (A)</div><input type="number" id="po" step="0.01"></div>
                <div><div class="label">Hyst (A)</div><input type="number" id="ph" step="0.01"></div>
            </div>
            <button class="btn" style="background: #0284c7;" onclick="savePen()">SAVE FACTORS</button>
        </div>
        <div class="card">
            <div class="label">Engineering Mode</div>
            <button id="db" class="btn" style="background: #475569;" onclick="set('debug', '0')">TOGGLE DEBUG</button>
        </div>
        <div class="card" style="border: 1px dashed #ef4444;">
            <div class="label" style="color: #ef4444;">DANGER ZONE</div>
            <button class="btn" style="background: #ef4444;" onclick="if(confirm('Reset all settings and WiFi to defaults?')) set('resetDefaults', '1')">RESET TO FACTORY</button>
        </div>
        <a href="/" class="link-footer">&larr; BACK TO DASHBOARD</a>
    </div>
    <script>
        function set(c, v) { fetch(`/control?cmd=${c}&val=${v}`); }
        function saveSafety() { set('maxCurr', document.getElementById('mc').value); set('minVolt', document.getElementById('mv').value); }
        function savePen() { set('penOff', document.getElementById('po').value); set('penHyst', document.getElementById('ph').value); }
        setInterval(() => {
            fetch('/telemetry').then(r => r.json()).then(data => {
                if (document.activeElement.tagName !== 'INPUT') {
                    document.getElementById('mc').value = data.mc;
                    document.getElementById('mv').value = data.mv;
                    document.getElementById('po').value = data.po;
                    document.getElementById('ph').value = data.ph;
                }
                let b = document.getElementById('db');
                if (data.debug) {
                    b.innerText = "SAFETY DISABLED (ON)";
                    b.classList.add('debug-on');
                } else {
                    b.innerText = "SAFETY ACTIVE (OFF)";
                    b.classList.remove('debug-on');
                }
            });
        }, 1000);
    </script>
</body></html>)=====";

const char INDEX_HTML[] PROGMEM = R"=====(
<!DOCTYPE html><html><head><meta charset="UTF-8"><meta name="viewport" content="width=device-width,initial-scale=1">
<title>EL-BASEET HAIR PEN-V1</title>
<style>
    body { font-family: 'Segoe UI', system-ui, sans-serif; text-align: center; background: radial-gradient(circle at top, #1e293b, #0f172a); color: white; margin: 0; min-height: 100vh; }
    .container { max-width: 420px; margin: auto; padding: 25px; }
    .header-wrap { display: flex; align-items: center; justify-content: center; gap: 15px; margin-bottom: 30px; }
    .logo-svg { width: 45px; height: 45px; fill: #38bdf8; animation: spin 5s linear infinite; filter: drop-shadow(0 0 10px rgba(56, 189, 248, 0.5)); }
    @keyframes spin { 100% { transform: rotate(360deg); } }
    h2 { font-weight: 300; letter-spacing: 3px; background: linear-gradient(to right, #38bdf8, #818cf8); -webkit-background-clip: text; -webkit-text-fill-color: transparent; margin: 0; }
    .stream-box { width: 100%; margin: 20px 0; border-radius: 20px; overflow: hidden; border: 2px solid #38bdf8; background: #000; box-shadow: 0 0 20px rgba(56, 189, 248, 0.3); }
    img { width: 100%; height: auto; display: block; }
    .card { background: rgba(30, 41, 59, 0.6); backdrop-filter: blur(10px); padding: 20px; margin: 15px 0; border-radius: 20px; border: 1px solid rgba(255, 255, 255, 0.05); box-shadow: 0 15px 35px rgba(0,0,0,0.4); }
    .btn { padding: 12px 24px; font-size: 14px; margin: 6px; cursor: pointer; border: none; border-radius: 12px; color: white; transition: all 0.3s; font-weight: 700; text-transform: uppercase; letter-spacing: 1px; }
    .btn-on { background: linear-gradient(135deg, #10b981, #059669); box-shadow: 0 4px 15px rgba(16, 185, 129, 0.3); }
    .btn-off { background: linear-gradient(135deg, #ef4444, #dc2626); box-shadow: 0 4px 15px rgba(239, 68, 68, 0.3); }
    .btn-dir { background: linear-gradient(135deg, #0ea5e9, #2563eb); box-shadow: 0 4px 15px rgba(14, 165, 233, 0.3); }
    .btn-flash { background: #f59e0b; color: #000; box-shadow: 0 4px 15px rgba(245, 158, 11, 0.3); }
    .slider { -webkit-appearance: none; width: 100%; height: 8px; border-radius: 5px; background: #334155; outline: none; margin: 25px 0; }
    .slider::-webkit-slider-thumb { -webkit-appearance: none; width: 22px; height: 22px; border-radius: 50%; background: #38bdf8; border: 3px solid #0f172a; }
    .value { color: #10b981; font-weight: 700; font-size: 1.4em; font-family: 'Courier New', Courier, monospace; }
    .label { font-size: 0.75em; color: #94a3b8; margin-bottom: 5px; text-transform: uppercase; letter-spacing: 1.5px; }
    .nav-grid { display: grid; grid-template-columns: 1fr 1fr; gap: 12px; margin-top: 15px; }
    .alarm { background: rgba(239, 68, 68, 0.2) !important; color: #f87171; border: 1px solid #ef4444 !important; font-weight: bold; display: none; animation: pulse 1s infinite; }
    .link-footer { margin-top: 25px; display: block; color: #64748b; text-decoration: none; font-size: 0.85em; transition: 0.3s; }
    .flex-row { display: flex; justify-content: space-around; align-items: center; }
    @keyframes pulse { 0% { opacity: 1; } 50% { opacity: 0.5; } 100% { opacity: 1; } }
</style>
</head><body>
    <div class="container">
        <div class="header-wrap">
            <svg class="logo-svg" viewBox="0 0 24 24"><path d="M12,15.5A3.5,3.5 0 0,1 8.5,12A3.5,3.5 0 0,1 12,8.5A3.5,3.5 0 0,1 15.5,12A3.5,3.5 0 0,1 12,15.5M19.43,12.97C19.47,12.65 19.5,12.33 19.5,12C19.5,11.67 19.47,11.34 19.43,11L21.54,9.37C21.73,9.22 21.78,8.95 21.66,8.73L19.66,5.27C19.54,5.05 19.27,4.97 19.05,5.05L16.56,6.05C16.04,5.66 15.5,5.32 14.87,5.07L14.5,2.42C14.46,2.18 14.25,2 14,2H10C9.75,2 9.54,2.18 9.5,2.42L9.13,5.07C8.5,5.32 7.96,5.66 7.44,6.05L4.95,5.05C4.73,4.97 4.46,5.05 4.34,5.27L2.34,8.73C2.21,8.95 2.27,9.22 2.46,9.37L4.57,11C4.53,11.34 4.5,11.67 4.5,12C4.5,12.33 4.53,12.65 4.57,12.97L2.46,14.63C2.27,14.78 2.21,15.05 2.34,15.27L4.34,18.73C4.46,18.95 4.73,19.03 4.95,18.95L7.44,17.94C7.96,18.34 8.5,18.68 9.13,18.93L9.5,21.58C9.54,21.82 9.75,22 10,22H14C14.25,22 14.46,21.82 14.5,21.58L14.87,18.93C15.5,18.68 16.04,18.34 16.56,17.94L19.05,18.95C19.27,19.03 19.54,18.95 19.66,18.73L21.66,15.27C21.78,15.05 21.73,14.78 21.54,14.63L19.43,12.97Z"/></svg>
            <h2>EL-BASEET<br><span style="font-size: 0.65em; letter-spacing: 4px; color: #38bdf8;">HAIR PEN-V1</span><br><span style="font-size: 0.35em; letter-spacing: 2px; color: #94a3b8;">SURGICAL ASSISTANT</span></h2>
        </div>
        <div id="alarmBox" class="card alarm">SYSTEM HALTED: OVERLOAD</div>
        <div class="stream-box"><img src="/stream"></div>
        
        <div class="card">
            <div class="flex-row">
                <div><div class="label">GRAFT COUNTER</div><div id="penCount" class="value" style="font-size: 2.8em; color: #10b981;">0</div></div>
            </div>
            <button class="btn btn-off" style="width: 50%; font-size: 0.7em; padding: 8px; margin-top: 15px; opacity: 0.8;" onclick="sendCmd('resetCnt', '0')">RESET COUNTER</button>
        </div>

        <div class="card">
            <div class="flex-row">
                <div><div class="label">SETPOINT</div><div id="speedVal" class="value">0</div></div>
                <div><div class="label">ACTUAL RPM</div><div id="rpm" class="value">0</div></div>
            </div>
            <input type="range" min="0" max="255" value="200" class="slider" id="speedSlider" oninput="updateSpeed(this.value)">
            <button class="btn btn-on" onclick="sendCmd('power', 'on')">ON</button>
            <button class="btn btn-off" onclick="sendCmd('power', 'off')">OFF</button>
            <button class="btn btn-dir" onclick="sendCmd('dir', 'toggle')">REVERSE</button>
        </div>

        <div class="card">
            <div class="label">STREAM OPTIMIZATION</div>
            <button class="btn btn-dir" style="background: #6366f1; width: 80%;" onclick="cycleQuality()">TOGGLE SPEED/QUALITY</button>
            <div id="qMsg" style="font-size: 0.8em; color: #94a3b8; margin-top: 10px;">Mode: High Detail</div>
        </div>

        <div class="card">
            <div class="label">FLASH BRIGHTNESS</div>
            <input type="range" min="0" max="255" value="0" class="slider" id="flashSlider" oninput="updateFlash(this.value)" style="accent-color: #f59e0b;">
        </div>

        <div class="nav-grid">
            <a href="/config" class="btn btn-dir" style="text-decoration:none; background: #334155;">SETTINGS</a>
            <a href="/readings" class="btn btn-dir" style="text-decoration:none; background: #7c3aed;">READINGS</a>
        </div>
        <a href="/wifi" class="link-footer">WIFI CONNECTION SETTINGS</a>
    </div>
    <script>
        function updateSpeed(val) { document.getElementById('speedVal').innerText = val; sendCmd('speed', val); }
        function updateFlash(val) { sendCmd('flash', val); }
        let qIdx = 0; const qVals = [10, 25, 50]; const qLabels = ["High Detail", "Balanced", "Turbo (Fastest)"];
        function cycleQuality() { qIdx = (qIdx + 1) % 3; document.getElementById('qMsg').innerText = "Mode: " + qLabels[qIdx]; sendCmd('quality', qVals[qIdx]); }
        function sendCmd(cmd, val) { fetch(`/control?cmd=${cmd}&val=${val}`); }
        let isFetching = false;
        setInterval(() => {
            if(isFetching) return;
            isFetching = true;
            fetch('/telemetry').then(r => r.json()).then(d => {
                document.getElementById('rpm').innerText = d.rpm;
                document.getElementById('penCount').innerText = d.cnt;
                if (document.activeElement.id !== 'speedSlider') {
                    document.getElementById('speedSlider').value = d.set;
                    document.getElementById('speedVal').innerText = d.set;
                }
                if (document.activeElement.id !== 'flashSlider') {
                    document.getElementById('flashSlider').value = d.flash;
                }
                document.getElementById('alarmBox').style.display = d.trip ? 'block' : 'none';
            }).finally(() => { isFetching = false; });
        }, 1000); // Increased to 1000ms to prevent CPU starvation
    </script>
</body></html>)=====";

void handleRoot() { server.send_P(200, "text/html", INDEX_HTML); }
void handleConfig() { server.send_P(200, "text/html", CONFIG_HTML); }
void handleReadings() { server.send_P(200, "text/html", READINGS_HTML); }
void handleWifi() { server.send_P(200, "text/html", WIFI_HTML); }

