osamaomar1012/Robotics_Projects_Arduino/ESP32_OLED_HPP_CAMERA_V2/EL-BASEET_HPP_Advance/web_server.h
void handleTelemetry() {
    // Dynamic allocation of 512 bytes on stack can be risky; using String for small JSON
    String json = "{";
    json += "\"v\":" + String(batteryVoltage, 2) + ",";
    json += "\"i\":" + String(currentDraw, 2) + ",";
    json += "\"p\":" + String(batteryPower, 2) + ",";
    json += "\"rpm\":" + String(estimatedRPM) + ",";
    json += "\"cnt\":" + String(penetrationCount) + ",";
    json += "\"pct\":" + String(batteryPercent) + ",";
    json += "\"spd\":" + String(abs(motorSpeed)) + ",";
    json += "\"set\":" + String(webBaseSpeed) + ",";
    json += "\"mc\":" + String(maxCurrentThreshold, 1) + ",";
    json += "\"mv\":" + String(minVoltageThreshold, 1) + ",";
    json += "\"trip\":" + String(((safetyTripped || lowBatteryTripped) && !debugMode) ? 1 : 0) + ",";
    json += "\"debug\":" + String(debugMode ? 1 : 0) + ",";
    json += "\"po\":" + String(penetrationOffset, 2) + ",";
    json += "\"ph\":" + String(penetrationHysteresis, 2) + ",";
    json += "\"calib\":" + String(calibrationNeeded ? 1 : 0) + ",";
    json += "\"baseI\":" + String(baselineCurrent, 2) + ",";
    json += "\"wifi_mode\":\"" + String(WiFi.status() == WL_CONNECTED ? "STA" : "AP") + "\",";
    json += "\"ip\":\"" + WiFi.localIP().toString() + "\",";
    json += "\"flash\":" + String(flashBrightness) + ",";
    json += "\"fps\":" + String(currentFPS, 1);
    json += "}";
    server.send(200, "application/json", json);
}

void handleControl() {
    String cmd = server.arg("cmd");
    String val = server.arg("val");

    // Priority Lock: If CrowPanel is active, ignore web control to save bandwidth/CPU
    if (millis() - lastEspNowFrameRequest < 5000) {
        server.send(503, "text/plain", "LOCKED: ESP-NOW Priority Active");
        return;
    }

    if (cmd == "power") {
        if (val == "on") {
            systemEnabled = true;
            safetyTripped = false; 
            lowBatteryTripped = false;
            if (webBaseSpeed > 0) {
                isPenetrating = false;
                calibrationNeeded = true;
            }
        } else {
            systemEnabled = false;
            baselineCurrent = 0.0;
            calibrationNeeded = false;
        }
        isPenetrating = false;
        displayWebConfirmation(systemEnabled ? "Motor ON" : "Motor OFF");
    }
    if (cmd == "dir") {
        forwardDirection = !forwardDirection;
        displayWebConfirmation(forwardDirection ? "FWD" : "REV");
    }
    if (cmd == "resetDefaults") {
        maxCurrentThreshold = 2.5;
        minVoltageThreshold = 3.2;
        webBaseSpeed = 200;
        penetrationOffset = 0.04;
        penetrationHysteresis = 0.02;
        penetrationCount = 0;
        debugMode = false;
        preferences.putFloat("maxCurr", 2.5);
        preferences.putFloat("minVolt", 3.2);
        preferences.putUChar("motSpd", 200);
        preferences.putFloat("penOff", 0.04);
        preferences.putFloat("penHyst", 0.02);
        preferences.putUInt("pCnt", 0);
        preferences.putBool("debug", false);
        preferences.putString("sta_ssid", ssid_sta);
        preferences.putString("sta_pass", pass_sta);
        displayWebConfirmation("Factory Reset...");
        delay(2000);
        ESP.restart();
    }
    if (cmd == "resetCnt") {
        penetrationCount = 0;
        preferences.putUInt("pCnt", 0); 
        displayWebConfirmation("Counter Reset");
    }
    if (cmd == "calibrate") {
        isPenetrating = false;
        calibrationNeeded = true;
        displayWebConfirmation("Calibrating...");
    }
    if (cmd == "speed") {
        webBaseSpeed = val.toInt();
        preferences.putUChar("motSpd", webBaseSpeed);
        calibrationNeeded = true;
        displayWebConfirmation("Spd: " + val);
    }
    if (cmd == "quality") {
        sensor_t * s = esp_camera_sensor_get();
        if (s) s->set_quality(s, val.toInt());
    }
    if (cmd == "flash") {
        if (CAM_PIN_FLASH != -1) {
            flashBrightness = val.toInt();
            ledcWrite(2, flashBrightness);
        }
    }
    if (cmd == "maxCurr") {
        maxCurrentThreshold = val.toFloat();
        preferences.putFloat("maxCurr", maxCurrentThreshold);
    }
    if (cmd == "minVolt") {
        minVoltageThreshold = val.toFloat();
        preferences.putFloat("minVolt", minVoltageThreshold);
    }
    if (cmd == "penOff") {
        penetrationOffset = val.toFloat();
        preferences.putFloat("penOff", penetrationOffset);
    }
    if (cmd == "penHyst") {
        penetrationHysteresis = val.toFloat();
        preferences.putFloat("penHyst", penetrationHysteresis);
    }
    if (cmd == "debug") {
        debugMode = !debugMode;
        if (debugMode) safetyTripped = false;
        preferences.putBool("debug", debugMode);
    }

    server.send(200, "text/plain", "OK");
}

void handleScan() {
    int n = WiFi.scanNetworks();
    String json = "[";
    for (int i = 0; i < n && i < 15; ++i) {
        if (i > 0) json += ",";
        json += "{\"ssid\":\"" + WiFi.SSID(i) + "\",\"rssi\":" + String(WiFi.RSSI(i)) + "}";
    }
    json += "]";
    server.send(200, "application/json", json);
}

void handleSaveWifi() {
    if (server.hasArg("ssid")) {
        preferences.putString("sta_ssid", server.arg("ssid"));
        preferences.putString("sta_pass", server.arg("pass"));
        server.send(200, "text/html", "Settings Saved. Restarting...");
        delay(2000);
        ESP.restart();
    } else {
        server.send(400, "text/plain", "Missing SSID");
    }
}

void mjpegStreamTask(void *pvParameters) {
    WiFiClient *client = (WiFiClient *)pvParameters;
    unsigned long lastCheck = millis();
    uint32_t frames = 0;

    client->setNoDelay(true);
    client->setTimeout(5); // Slight increase to allow for network retries

    isWebStreaming = true; // Set priority flag for WiFi

    while (client->connected()) {
        // Priority Lock: Exit stream if ESP-NOW is requesting frames
        if (millis() - lastEspNowFrameRequest < 5000) {
            Serial.println("MJPEG: Stream terminated - Priority to ESP-NOW");
            break;
        }

        camera_fb_t * fb = esp_camera_fb_get();
        if (!fb) {
            vTaskDelay(pdMS_TO_TICKS(1));
            continue;
        }

        frames++;
        if (millis() - lastCheck >= 1000) {
            currentFPS = frames;
            frames = 0;
            lastCheck = millis();
        }

        if (client->printf("--frame\r\nContent-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n", fb->len) <= 0 ||
            client->write(fb->buf, fb->len) != fb->len ||
            client->print("\r\n") <= 0) {
            esp_camera_fb_return(fb);
            break;
        }
        esp_camera_fb_return(fb);
        taskYIELD(); // Yield only to other tasks, don't force sleep
    }
    isWebStreaming = false; // Release WiFi priority
    client->stop();
    delete client;
    vTaskDelete(NULL);
}

void handleStream() {
    if (!cameraActive) {
        server.send(503, "text/plain", "Camera Module Not Active");
        return;
    }

    // Priority Lock: Prevent new web stream if CrowPanel is active
    if (millis() - lastEspNowFrameRequest < 5000) {
        server.send(503, "text/plain", "Priority: ESP-NOW Active");
        return;
    }

    WiFiClient *pClient = new WiFiClient(server.client());
    if (!pClient->connected()) {
        delete pClient;
        return;
    }
    pClient->print("HTTP/1.1 200 OK\r\nContent-Type: multipart/x-mixed-replace; boundary=frame\r\n\r\n");
    // Priority 6 allows WiFi stack (18-20) to breathe while keeping stream responsive
    xTaskCreatePinnedToCore(mjpegStreamTask, "strm", 4096, (void*)pClient, 6, NULL, 0); 
}

