osamaomar1012/Robotics_Projects_Arduino/ESP32_OLED_HPP_CAMERA_V2/EL-BASEET_HPP_Advance/web_server.h
volatile bool frameRequested = false;
volatile bool switchResRequested = false;
volatile bool zoomRequested = false;

// Callback to handle the "Pull" request from the CrowPanel
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
void onEspNowRecv(const esp_now_recv_info_t *info, const uint8_t *data, int len) {
    const uint8_t* mac = info->src_addr;
#else
void onEspNowRecv(const uint8_t *mac, const uint8_t *data, int len) {
#endif
    if (len < 1) return;
    uint8_t cmd = data[0];

    switch (cmd) {
        case 0x01: switchResRequested = true; break;
        case 0x02: // Start/Heartbeat for Continuous Stream
            frameRequested = true; 
            lastEspNowFrameRequest = millis(); // Update priority timestamp
            break;
        case 0x03: zoomRequested = true; break;
        
        // Motor Power: 0x10 [state]
        case 0x10: 
            if (len > 1) {
                systemEnabled = (data[1] == 1);
                if (systemEnabled) { safetyTripped = false; lowBatteryTripped = false; calibrationNeeded = true; }
                else { baselineCurrent = 0.0; }
            }
            break;

        // Motor Direction: 0x11 [0=FWD, 1=REV]
        case 0x11:
            if (len > 1) forwardDirection = (data[1] == 0);
            break;

        // Motor Speed: 0x12 [0-255]
        case 0x12:
            if (len > 1) {
                webBaseSpeed = data[1];
                preferences.putUChar("motSpd", webBaseSpeed);
                calibrationNeeded = true;
            }
            break;

        // Flash Brightness: 0x13 [0-255]
        case 0x13:
            if (len > 1 && CAM_PIN_FLASH != -1) {
                flashBrightness = data[1];
                ledcWrite(2, flashBrightness);
            }
            break;

        // Reset Graft Counter: 0x14
        case 0x14:
            penetrationCount = 0;
            preferences.putUInt("pCnt", 0);
            break;

        // Calibrate Baseline: 0x15
        case 0x15:
            calibrationNeeded = true;
            break;

        // Thresholds: 0x20 [MaxCurr*10], 0x21 [MinVolt*10]
        case 0x20:
            if (len > 1) { maxCurrentThreshold = data[1] / 10.0f; preferences.putFloat("maxCurr", maxCurrentThreshold); }
            break;
        case 0x21:
            if (len > 1) { minVoltageThreshold = data[1] / 10.0f; preferences.putFloat("minVolt", minVoltageThreshold); }
            break;

        case 0x04: // Camera Brightness (requires 2 bytes)
            if (len == 2) {
                sensor_t * s = esp_camera_sensor_get();
                if (s) s->set_brightness(s, (int8_t)map(data[1], 0, 100, -2, 2));
            }
            break;
    }
}

void espNowStreamTask(void *pvParameters) {
    uint8_t packetData[250];
    while (1) {
        // Handle resolution change request
        if (switchResRequested) {
            switchResRequested = false;
            sensor_t * s = esp_camera_sensor_get();
            if (s) {
                // Cycle between QVGA (320x240) and CIF (400x296)
                framesize_t nextRes = (s->status.framesize == FRAMESIZE_QVGA) ? FRAMESIZE_CIF : FRAMESIZE_QVGA;
                s->set_framesize(s, nextRes);
                Serial.printf("Resolution changed to: %s\n", (nextRes == FRAMESIZE_CIF) ? "CIF" : "QVGA");
            }
            vTaskDelay(pdMS_TO_TICKS(200)); // Give sensor time to reset
        }

        // Handle digital zoom request
        if (zoomRequested) {
            zoomRequested = false;
            sensor_t * s = esp_camera_sensor_get();
            if (s) {
                static bool isZoomed = false;
                isZoomed = !isZoomed;
                // OV2640 Hack: Using set_special_effect or binning to simulate zoom/focus
                s->set_special_effect(s, isZoomed ? 2 : 0); // 2 = Grayscale/Retro, used here as visual feedback
            }
        }

        // FASTEST STREAM LOGIC: If a request was heard in the last 2 seconds, 
        // treat it as an active "Push" session.
        bool pushModeActive = (millis() - lastEspNowFrameRequest < 2000);
        if (isWebStreaming && !pushModeActive) { frameRequested = false; }

        if (!cameraActive || (!frameRequested && !pushModeActive)) {
            vTaskDelay(pdMS_TO_TICKS(1)); 
            continue; 
        }

        camera_fb_t *fb = esp_camera_fb_get();
        if (!fb) {
            vTaskDelay(pdMS_TO_TICKS(1));
            continue;
        }

        frameRequested = false; // Reset request flag
        size_t offset = 0;
        uint16_t chunkSeq = 0;

        while (offset < fb->len) {
            size_t chunkSize = (fb->len - offset) > 248 ? 248 : (fb->len - offset);
            
            // Metadata: Sequence Number (2 bytes)
            packetData[0] = chunkSeq & 0xFF;
            packetData[1] = (chunkSeq >> 8) & 0xFF;
            
            // Payload
            memcpy(&packetData[2], fb->buf + offset, chunkSize);
            
            // CRITICAL: esp_now_send returns immediately if the radio buffer has space.
            // We check return status to ensure we aren't dropping packets at the driver level.
            esp_err_t result = esp_now_send(targetMac, packetData, chunkSize + 2);
            
            // Expert Tune: 40-50us is the "Sweet Spot" for ESP32-S3 RX buffers
            // Any faster and the S3's WiFi RX buffer will overflow.
            delayMicroseconds(50); 

            offset += chunkSize;
            chunkSeq++;
        }

        esp_camera_fb_return(fb);
        // No forced delay here; the receiver controls the speed
    }
}

void setupWeb() {
    // Use AP_STA to support both Web Server and ESP-NOW concurrently
    WiFi.mode(WIFI_AP_STA);

    // 1. Setup Access Point (Local Device Network)
    WiFi.softAP(WIFI_SSID_AP, WIFI_PASS_AP, 1, 0, 4);

    // 2. Attempt to connect to saved Station (Router Network)
    String s = preferences.getString("sta_ssid", "");
    String p = preferences.getString("sta_pass", "");
    if (s.length() > 0) {
        Serial.println("Connecting to Station: " + s);
        wifiConnecting = true;
        WiFi.begin(s.c_str(), p.c_str());
    }

    WiFi.setTxPower(WIFI_POWER_19_5dBm); // Set maximum WiFi transmission power

    // CRITICAL: Disable WiFi Power Management to stop the "lazy" connection
    // This keeps the radio on at all times for immediate ESP-NOW/WiFi response
    esp_wifi_set_ps(WIFI_PS_NONE);
    Serial.println("WiFi Power Management: DISABLED (Performance Mode)");

    // 3. Setup mDNS (Access via http://el-baseet.local)
    if (MDNS.begin("el-baseet")) {
        MDNS.addService("http", "tcp", 80);
        Serial.println("mDNS started: http://el-baseet.local");
    }

    server.on("/", handleRoot);
    server.on("/config", handleConfig);
    server.on("/readings", handleReadings);
    server.on("/wifi", handleWifi);
    server.on("/telemetry", handleTelemetry);
    server.on("/control", handleControl);
    server.on("/scan", handleScan);
    server.on("/savewifi", HTTP_POST, handleSaveWifi);
    server.on("/stream", handleStream);
    server.begin();
    Serial.println("AP IP: " + WiFi.softAPIP().toString());
}

#endif